BAS BMEKZU Project/src/InformationRegisters/СтатьиЗатратПоВзносамФОТ/СтатьиЗатратПоВзносамФОТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатьиЗатратПоВзносамФОТ</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </resources>
  <resources>
    <name>УДАЛИТЬСтатьяВаловыхРасходов</name>
    <type>
      <types>CatalogRef.СтатьиНалоговыхДеклараций</types>
    </type>
  </resources>
  <dimensions>
    <name>Налог</name>
    <type>
      <types>CatalogRef.Налоги</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетЗатрат</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

BAS BMEKZU Project/src/InformationRegisters/ОтражениеВзносовВРеглУчете/ОтражениеВзносовВРеглУчете.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтражениеВзносовВРеглУчете</name>
  <comment>(регл.)</comment>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>СпособОтраженияВРеглУчете</name>
    <type>
      <types>CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</types>
    </type>
  </resources>
  <dimensions>
    <name>Налог</name>
    <type>
      <types>CatalogRef.Налоги</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

BAS BMEKZU Project/src/InformationRegisters/КоэффициентРезерваОтпусков/КоэффициентРезерваОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КоэффициентРезерваОтпусков</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

BAS BMEKZU Project/src/Enums/ВидыОперацийПоЗарплате/ВидыОперацийПоЗарплате.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийПоЗарплате</name>
  <enumValues>
    <name>НачисленоДоход</name>
  </enumValues>
  <enumValues>
    <name>НачисленоБольничные</name>
  </enumValues>
  <enumValues>
    <name>НачисленоОтпускныеДоход</name>
  </enumValues>
  <enumValues>
    <name>НачисленоОтпускныеРезерв</name>
  </enumValues>
  <enumValues>
    <name>НатуральныйДоход</name>
  </enumValues>
  <enumValues>
    <name>НачисленоСдельноДоход</name>
  </enumValues>
  <enumValues>
    <name>НачисленоЗаСчетФССДоход</name>
  </enumValues>
  <enumValues>
    <name>ДивидендыСотрудников</name>
  </enumValues>
  <enumValues>
    <name>Алименты</name>
  </enumValues>
  <enumValues>
    <name>ИсполнительныеЛисты</name>
  </enumValues>
  <enumValues>
    <name>ПочтовыйСбор</name>
  </enumValues>
  <enumValues>
    <name>ПогашениеЗаймов</name>
  </enumValues>
  <enumValues>
    <name>ПроцентыПоЗайму</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеУдержания</name>
  </enumValues>
  <enumValues>
    <name>УдержаниеЕСВ</name>
  </enumValues>
  <enumValues>
    <name>НачислениеЕСВРезерв</name>
  </enumValues>
  <enumValues>
    <name>НачислениеЕСВ</name>
  </enumValues>
  <enumValues>
    <name>НДФЛ</name>
  </enumValues>
  <enumValues>
    <name>Депонирование</name>
  </enumValues>
  <enumValues>
    <name>СписаниеДепонента</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеРасчетыСПерсоналом</name>
  </enumValues>
  <enumValues>
    <name>ВоенныйСбор</name>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/Catalogs/СпособыОтраженияЗарплатыВРеглУчете/СпособыОтраженияЗарплатыВРеглУчете.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СпособыОтраженияЗарплатыВРеглУчете</name>
  <comment>(Регл)</comment>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>НеИспользуются</name>
      <description>Не используются</description>
    </items>
    <items>
      <name>ПоУмолчанию</name>
      <description>По умолчанию</description>
    </items>
    <items>
      <name>Служебные</name>
      <description>Служебные</description>
    </items>
  </predefined>
  <attributes>
    <name>СчетДт</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоДт1</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоДт2</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоДт3</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетКт</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоКт1</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоКт2</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоКт3</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>НалоговоеНазначениеДоходовИЗатрат</name>
    <type>
      <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>НалоговоеНазначение</name>
    <type>
      <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>СтратегияОтраженияЕСВФОТ</name>
    <type>
      <types>EnumRef.СтратегииОтраженияВУчетеЕСВ</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтраженияЕСВФОТ</name>
    <type>
      <types>CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНАГРО_ВзносыОсновногоНачисления</name>
    <comment>Особый способ отражения взносов</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСтатьяВаловыхРасходов</name>
    <type>
      <types>CatalogRef.СтатьиНалоговыхДеклараций</types>
    </type>
  </attributes>
</mdclass:Catalog>

BAS BMEKZU Project/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФизическиеЛица</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДатаРождения</name>
    <comment>Дата рождения</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоДРФО</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <comment>Пол</comment>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСтраховойНомерПФ</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоРождения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>240</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.ГруппыДоступаФизическихЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПол</name>
    <comment>Пол</comment>
    <type>
      <types>EnumRef.УдалитьПолФизическихЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УточнениеНаименования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <comment>Дата регистрации</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСлужебное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставСемьи</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>СтепеньРодства</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.СтепениРодстваФизЛиц</types>
      </type>
    </attributes>
    <attributes>
      <name>ФизЛицо</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ГодРождения</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Иждивенец</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИНАГРО_Образование</name>
    <attributes>
      <name>ВидОбразования</name>
      <type>
        <types>CatalogRef.ИНАГРО_ВидыОбразованияФизЛиц</types>
      </type>
    </attributes>
    <attributes>
      <name>УчебноеЗаведение</name>
      <type>
        <types>CatalogRef.ИНАГРО_УчебныеЗаведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Специальность</name>
      <type>
        <types>CatalogRef.ИНАГРО_КлассификаторСпециальностейПоОбразованию</types>
      </type>
    </attributes>
    <attributes>
      <name>Диплом</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГодОкончания</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Квалификация</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Факультет</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УченаяСтепень</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФормаОбучения</name>
      <type>
        <types>EnumRef.ИНАГРО_ФормыОбучения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИНАГРО_ТрудоваяДеятельность</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

BAS BMEKZU Project/src/CommonModules/ОтражениеЗарплатыВБухучете/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Отражение зарплаты в регламентированном учёте
// 
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Функция формирует структуру с данными отражения зарплаты для бухучета
//
// Параметры
//  Организация, тип СправочникСсылка.Организации
//  ПериодРегистрации – тип дата, первое число месяца
//  СтрокаСписокТаблиц - Тип Строка, в строке переданы имена таблиц, которые необходимо заполнить
//				         имена таблиц соответствуют именам табличных частей документа ОтражениеЗарплатыВБухучете 
//  Отказ - Булево
//  ДанныеДляПроведения - Структура, ключ - имя регистра, значение - таблица значений с движениями документа
//						это источник данных, если Неопределено, тогда источник данных - движения регистров
//
// Возвращаемое значение
// 		Структура ДанныеДляОтражения
//			Ключ - имя таблицы, соответствует именам табличных частей документа ОтражениеЗарплатыВБухучете
//			Значение - таблица значений, соответствующая структуре табличных частей документа ОтражениеЗарплатыВБухучете
//
Функция ДанныеДляОтраженияЗарплатыВБухучете(ПериодРегистрации, Организация, СтрокаСписокТаблиц = "", РезультатыРасчетаЗарплаты = Неопределено) Экспорт
	
	ДанныеДляОтражения = Новый Структура;
	
	Если ПустаяСтрока(СтрокаСписокТаблиц) или Найти(СтрокаСписокТаблиц, "НачисленнаяЗарплатаИВзносы") > 0 Тогда
		
		ТаблицаНачисленнаяЗарплатаИВзносы = БухучетНачисленийВзносов(Организация, ПериодРегистрации, РезультатыРасчетаЗарплаты);
		ТаблицаНачисленнаяЗарплатаИВзносы = РасчетРезерваОтпусков(Организация, ПериодРегистрации, ТаблицаНачисленнаяЗарплатаИВзносы);
		ДанныеДляОтражения.Вставить("НачисленнаяЗарплатаИВзносы", ТаблицаНачисленнаяЗарплатаИВзносы);
		
	КонецЕсли;
	
	Если ПустаяСтрока(СтрокаСписокТаблиц) или Найти(СтрокаСписокТаблиц, "УдержанныйЕСВ") > 0 Тогда
		
		ТаблицаУдержанныйЕСВ = БухучетЕСВ(Организация, ПериодРегистрации, РезультатыРасчетаЗарплаты);
		ДанныеДляОтражения.Вставить("УдержанныйЕСВ", ТаблицаУдержанныйЕСВ);
		
	КонецЕсли;
	
	Если ПустаяСтрока(СтрокаСписокТаблиц) или Найти(СтрокаСписокТаблиц, "УдержанныйНДФЛ") > 0 Тогда
		
		ТаблицаУдержанныйНДФЛ = БухучетНДФЛ(Организация, ПериодРегистрации, РезультатыРасчетаЗарплаты);
		ДанныеДляОтражения.Вставить("УдержанныйНДФЛ", ТаблицаУдержанныйНДФЛ);
		
	КонецЕсли;
	
	Если ПустаяСтрока(СтрокаСписокТаблиц) или Найти(СтрокаСписокТаблиц, "УдержаннаяЗарплата") > 0 Тогда
		
		ТаблицаУдержаннаяЗарплата = БухучетУдержаний(Организация, ПериодРегистрации, РезультатыРасчетаЗарплаты);
		ДанныеДляОтражения.Вставить("УдержаннаяЗарплата", ТаблицаУдержаннаяЗарплата);
		
	КонецЕсли;

	Возврат ДанныеДляОтражения;
	
КонецФункции

// Функция возвращает таблицу значений с данными бухучета удержаний
//		Поля таблицы
//				ФизическоеЛицо - СправочникСсылка.ФизическиеЛица
//				Подразделение  - СправочникСсылка.ПодразделенияОрганизаций
//				ВидОперации    - ПеречислениеСсылка.ВидыОперацийПоЗарплате
//				Контрагент     - СправочникСсылка.Контрагенты, контрагент, в пользу которого произведено удержание
//				Сумма - Число 15.2
//
// Параметры
//	Организация – СправочникСсылка.Организации
//	ПериодРегистрации – Дата
//	РезультатыРасчетаЗарплаты – структура,  содержит таблицы значений с движениями регистров
//					если структура передается, то таблицы будут источником данных для
//					отражения в учете
//
Функция БухучетУдержаний(Организация, ПериодРегистрации, РезультатыРасчетаЗарплаты = Неопределено) Экспорт

	ТаблицаУдержаннаяЗарплата = ОтражениеЗарплатыВУчете.ДанныеДляОтражениеВУчетеУдержаний(ПериодРегистрации, Организация, РезультатыРасчетаЗарплаты);
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ТаблицаУдержаннаяЗарплата", ТаблицаУдержаннаяЗарплата);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УдержаннаяЗарплата.Организация,
	|	УдержаннаяЗарплата.Сотрудник,
	|	УдержаннаяЗарплата.ФизическоеЛицо,
	|	УдержаннаяЗарплата.Подразделение,
	|	УдержаннаяЗарплата.Удержание,
	|	УдержаннаяЗарплата.Контрагент,
	|	УдержаннаяЗарплата.ВидОперации,
	|	УдержаннаяЗарплата.СчетУчета,
	|	УдержаннаяЗарплата.Сумма
	|ПОМЕСТИТЬ ВТУдержаннаяЗарплата
	|ИЗ
	|	&ТаблицаУдержаннаяЗарплата КАК УдержаннаяЗарплата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УдержаннаяЗарплата.Организация,
	|	УдержаннаяЗарплата.Сотрудник,
	|	УдержаннаяЗарплата.ФизическоеЛицо,
	|	УдержаннаяЗарплата.Подразделение,
	|	УдержаннаяЗарплата.Удержание,
	|	УдержаннаяЗарплата.Контрагент,
	|	УдержаннаяЗарплата.ВидОперации,
	|	УдержаннаяЗарплата.СчетУчета,
	|	УдержаннаяЗарплата.Сумма,
	|	ЕСТЬNULL(Удержания.СпособОтраженияВБухучете, ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ОтражениеУдержанийПоУмолчанию)) КАК СпособОтраженияВБухУчете 
	|ИЗ
	|	ВТУдержаннаяЗарплата КАК УдержаннаяЗарплата
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Удержания КАК Удержания
	|		ПО УдержаннаяЗарплата.Удержание = Удержания.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
	|		ПО УдержаннаяЗарплата.ФизическоеЛицо = ФизическиеЛица.Ссылка
	|УПОРЯДОЧИТЬ ПО
	|	ФизическиеЛица.Ссылка.Наименование";
	
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

//
Функция БухучетНДФЛ(Организация, ПериодРегистрации, РезультатыРасчетаЗарплаты = Неопределено) Экспорт

	ДанныеНДФЛ = ОтражениеЗарплатыВУчете.ДанныеДляОтражениеВУчетеНДФЛ(ПериодРегистрации, Организация, РезультатыРасчетаЗарплаты);
	
	Запрос = Новый Запрос;
	МенеджерВременныхТаблиц = ДанныеНДФЛ.МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);

	// получим отражение в бухучете удержанного НДФЛ
	ОтражениеЗарплатыВБухучетеВнутренний.СоздатьВТБухучетНДФЛ(Организация, ПериодРегистрации, МенеджерВременныхТаблиц);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БухучетНДФЛ.ПериодРегистрации,
	|	БухучетНДФЛ.Организация,
	|	БухучетНДФЛ.ФизическоеЛицо,
	|	БухучетНДФЛ.ДоходНДФЛ,
	|	БухучетНДФЛ.СчетУчета,
	|	БухучетНДФЛ.Сумма,
	|	БухучетНДФЛ.ВидОперации,
	|	БухучетНДФЛ.СпособОтраженияВБухУчете
	|ИЗ
	|	ВТБухучетНДФЛ КАК БухучетНДФЛ
	|УПОРЯДОЧИТЬ ПО
	|	БухучетНДФЛ.ФизическоеЛицо.Наименование";

	Возврат Запрос.Выполнить().Выгрузить();


КонецФункции

// Функция возвращает таблицу значений с данными бухучета начислений и взносов
//		Поля таблицы описаны в НоваяТаблицаНачисленнаяЗарплатаИВзносы()
//
// Параметры
//	Организация – СправочникСсылка.Организации
//	ПериодРегистрации – Дата
//	РезультатыРасчетаЗарплаты – структура,  содержит таблицы значений с движениями регистров
//					если структура передается, то таблицы будут источником данных для
//					отражения в учете
//
Функция БухучетНачисленийВзносов(Организация, ПериодРегистрации, РезультатыРасчетаЗарплаты = Неопределено) Экспорт

	ТаблицаНачисленнаяЗарплатаИВзносы = НоваяТаблицаНачисленнаяЗарплатаИВзносы();
	
	ТаблицаНачислений = ОтражениеЗарплатыВУчете.ДанныеДляОтражениеВУчетеНачислений(ПериодРегистрации, Организация, РезультатыРасчетаЗарплаты);
	ДанныеВзносов     = ОтражениеЗарплатыВУчете.ДанныеДляОтражениеВУчетеВзносов(ПериодРегистрации, Организация, РезультатыРасчетаЗарплаты);
	ТаблицаВзносов    = ДанныеВзносов.ТаблицаВзносов;
	ТаблицаВзносов.Колонки["Сумма"].Имя = "СуммаВзносов";
	
	//Распределение таблицы взносов по таблице начислений
	ПоляРазрез = Новый Массив();
	ПоляРазрез.Добавить("Сотрудник");
	ПоляРазрез.Добавить("Подразделение");
	ПоляРазрез.Добавить("ВидОперации");
	ПоляРазрез.Добавить("Начисление");
	ПоляСвязи = Новый Структура();
	ПоляСвязи.Вставить("Организация","Организация");
	ПоляСвязи.Вставить("ФизическоеЛицо","ФизическоеЛицо");
	ПоляСвязи.Вставить("ВидЕСВ","ВидЕСВ");
	ПоляСвязи.Вставить("НалоговыйПериод","НалоговыйПериодЕСВ");
	ТаблицаРаспределения = ОтражениеЗарплатыВУчете.РаспределитьТаблицуПропорциональноТаблицеКоэффициентов(ТаблицаВзносов, "СуммаВзносов", ТаблицаНачислений, "Сумма", ПоляРазрез, ПоляСвязи);

	Запрос = Новый Запрос;
	//МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	МенеджерВременныхТаблиц = ДанныеВзносов.МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ТаблицаНачислений", ТаблицаНачислений);
	Запрос.УстановитьПараметр("ТаблицаРаспределения", ТаблицаРаспределения);
	Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&ПериодРегистрации КАК ПериодРегистрации,
	|	ТаблицаНачислений.Организация,
	|	ТаблицаНачислений.Сотрудник,
	|	ТаблицаНачислений.ФизическоеЛицо,
	|	ТаблицаНачислений.Подразделение,
	|	ТаблицаНачислений.НалоговыйПериодЕСВ,
	|	ТаблицаНачислений.ВидОперации,
	|	ТаблицаНачислений.Начисление,
	|	ТаблицаНачислений.Сумма
	|ПОМЕСТИТЬ ВТНачисления
	|ИЗ
	|	&ТаблицаНачислений КАК ТаблицаНачислений
	|;
	|
	|/////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ПериодРегистрации КАК ПериодРегистрации,
	|	ТаблицаРаспределения.Организация,
	|	ТаблицаРаспределения.Сотрудник,
	|	ТаблицаРаспределения.ФизическоеЛицо,
	|	ТаблицаРаспределения.Подразделение,
	|	ТаблицаРаспределения.НалоговыйПериод,
	|	ТаблицаРаспределения.ВидОперации,
	|	ТаблицаРаспределения.Начисление,
	|	ТаблицаРаспределения.СуммаВзносов,
	|	ТаблицаРаспределения.СтатьяНалоговойДекларации,
	|	ТаблицаРаспределения.Налог
	|ПОМЕСТИТЬ ВТРаспределениеЕСВ
	|ИЗ
	|	&ТаблицаРаспределения КАК ТаблицаРаспределения
	|;
	|
	|/////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ПериодРегистрации КАК ПериодРегистрации,
	|	ЕСТЬNULL(Начисления.Организация, Взносы.Организация) КАК Организация, 
	|	ЕСТЬNULL(Начисления.Сотрудник, Взносы.Сотрудник) КАК Сотрудник,
	|	ЕСТЬNULL(Начисления.ФизическоеЛицо, Взносы.ФизическоеЛицо) КАК ФизическоеЛицо,
	|	ЕСТЬNULL(Начисления.Подразделение, Взносы.Подразделение) КАК Подразделение,
	|	ЕСТЬNULL(Начисления.ВидОперации, Взносы.ВидОперации) КАК ВидОперации,
	|	ЕСТЬNULL(Начисления.Начисление, Взносы.Начисление) КАК Начисление,
	|	ЕСТЬNULL(Взносы.СтатьяНалоговойДекларации, ЗНАЧЕНИЕ(Справочник.СтатьиНалоговыхДеклараций.ПустаяСсылка)) КАК СтатьяНалоговойДекларации,
	|	ЕСТЬNULL(Взносы.Налог, ЗНАЧЕНИЕ(Справочник.Налоги.ПустаяСсылка)) КАК Налог,
	|	ЕСТЬNULL(Начисления.Сумма, 0) КАК Сумма,
	|	ЕСТЬNULL(Взносы.СуммаВзносов, 0) КАК СуммаВзносов
	|ПОМЕСТИТЬ ВТНачисленнаяЗарплатаИВзносы
	|ИЗ
	|	ВТНачисления КАК Начисления
	|   ПОЛНОЕ СОЕДИНЕНИЕ
	|	ВТРаспределениеЕСВ КАК Взносы
	|	ПО Начисления.Организация = Взносы.Организация
	|	 И Начисления.Сотрудник = Взносы.Сотрудник
	|	 И Начисления.ФизическоеЛицо = Взносы.ФизическоеЛицо
	|	 И Начисления.Подразделение = Взносы.Подразделение
	|	 И Начисления.НалоговыйПериодЕСВ = Взносы.НалоговыйПериод
	|	 И Начисления.ВидОперации = Взносы.ВидОперации
	|	 И Начисления.Начисление = Взносы.Начисление
	|";
	Запрос.Выполнить();
	
	
	// добавим отражение в бухучете начислений
	ОтражениеЗарплатыВБухучетеВнутренний.СоздатьВТБухучетНачислений(Организация, ПериодРегистрации, МенеджерВременныхТаблиц);
	
	// добавим отражение в бухучете взносов
	ОтражениеЗарплатыВБухучетеВнутренний.СоздатьВТБухучетВзносов(Организация, ПериодРегистрации, МенеджерВременныхТаблиц);
	
	
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НачисленнаяЗарплатаИВзносы.ПериодРегистрации,
	|	НачисленнаяЗарплатаИВзносы.Сотрудник,
	|	НачисленнаяЗарплатаИВзносы.ФизическоеЛицо,
	|	НачисленнаяЗарплатаИВзносы.Подразделение,
	|	НачисленнаяЗарплатаИВзносы.Начисление,
	|	НачисленнаяЗарплатаИВзносы.ВидОперации,
	|	НачисленнаяЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете,
	|	НачисленнаяЗарплатаИВзносы.СтатьяНалоговойДекларации,
	|	НачисленнаяЗарплатаИВзносы.Налог,
	|	НачисленнаяЗарплатаИВзносы.Сумма,
	|	НачисленнаяЗарплатаИВзносы.СуммаВзносов КАК СуммаВзносы,
	|	НачисленнаяЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучетеВзносы,
	|	НачисленнаяЗарплатаИВзносы.Начисление.СчетУчета КАК СчетКт,
	|	ВЫБОР 
	|		КОГДА ЕСТЬNULL(ОтражениеВзносовВРеглУчете.СпособОтраженияВРеглУчете, ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СпособыОтраженияЗарплатыВРеглУчете.ПустаяСсылка)
	|        ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|		 ИНАЧЕ ОтражениеВзносовВРеглУчете.СпособОтраженияВРеглУчете.СчетКт 
	|	КОНЕЦ КАК СчетКтВзносы,
	|	СтатьиЗатратПоВзносамФОТ.СтатьяЗатрат КАК СтатьяЗатратВзносы
	|ИЗ
	|	ВТБУНачисленнаяЗарплатаИБУВзносы КАК НачисленнаяЗарплатаИВзносы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатьиЗатратПоВзносамФОТ.СрезПоследних(&ПериодРегистрации) КАК СтатьиЗатратПоВзносамФОТ
	|       ПО НачисленнаяЗарплатаИВзносы.СпособОтраженияЗарплатыВБухучете.СчетДт = СтатьиЗатратПоВзносамФОТ.СчетЗатрат
	|        И НачисленнаяЗарплатаИВзносы.Налог = СтатьиЗатратПоВзносамФОТ.Налог
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтражениеВзносовВРеглУчете.СрезПоследних(&ПериодРегистрации) КАК ОтражениеВзносовВРеглУчете
	|       ПО НачисленнаяЗарплатаИВзносы.Налог = ОтражениеВзносовВРеглУчете.Налог
	|УПОРЯДОЧИТЬ ПО
	|	НачисленнаяЗарплатаИВзносы.ФизическоеЛицо.Наименование";

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаНачисленнаяЗарплатаИВзносы.Добавить(),Выборка);
	КонецЦикла;

	Возврат ТаблицаНачисленнаяЗарплатаИВзносы;

КонецФункции

Функция БухучетЕСВ(Организация, ПериодРегистрации, РезультатыРасчетаЗарплаты = Неопределено) Экспорт

	ДанныеЕСВ     = ОтражениеЗарплатыВУчете.ДанныеДляОтражениеВУчетеЕСВ(ПериодРегистрации, Организация, РезультатыРасчетаЗарплаты);
	
	Запрос = Новый Запрос;
	МенеджерВременныхТаблиц = ДанныеЕСВ.МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
	
	// получим отражение в бухучете удержанного ЕСВ
	ОтражениеЗарплатыВБухучетеВнутренний.СоздатьВТБухучетЕСВ(Организация, ПериодРегистрации, МенеджерВременныхТаблиц);
	
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БухучетЕСВ.ПериодРегистрации,
	|	БухучетЕСВ.Организация,
	|	БухучетЕСВ.ФизическоеЛицо,
	|	БухучетЕСВ.ВидЕСВ,
	|	БухучетЕСВ.СтатьяНалоговойДекларации,
	|	БухучетЕСВ.Налог,
	|	БухучетЕСВ.СчетУчета,
	|	БухучетЕСВ.Сумма,
	|	БухучетЕСВ.ВидОперации,
	|	БухучетЕСВ.СпособОтраженияВБухУчете
	|ИЗ
	|	ВТБухучетЕСВ КАК БухучетЕСВ
	|УПОРЯДОЧИТЬ ПО
	|	БухучетЕСВ.ФизическоеЛицо.Наименование";

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Функция НоваяТаблицаНачисленнаяЗарплатаИВзносы() Экспорт
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	Таблица.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	Таблица.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	Таблица.Колонки.Добавить("ВидОперации", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыОперацийПоЗарплате"));
	Таблица.Колонки.Добавить("СпособОтраженияЗарплатыВБухучете", Новый ОписаниеТипов("СправочникСсылка.СпособыОтраженияЗарплатыВРеглУчете"));
	Таблица.Колонки.Добавить("СчетДт", Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	Таблица.Колонки.Добавить("СчетКт", Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	Таблица.Колонки.Добавить("НалоговыйПериодЕСВ", Новый ОписаниеТипов("Дата"));
	Таблица.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	Таблица.Колонки.Добавить("Налог", Новый ОписаниеТипов("СправочникСсылка.Налоги"));
	Таблица.Колонки.Добавить("СтатьяНалоговойДекларации", Новый ОписаниеТипов("СправочникСсылка.СтатьиНалоговыхДеклараций"));
	Таблица.Колонки.Добавить("СуммаВзносы", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	Таблица.Колонки.Добавить("СпособОтраженияЗарплатыВБухучетеВзносы", Новый ОписаниеТипов("СправочникСсылка.СпособыОтраженияЗарплатыВРеглУчете"));
	Таблица.Колонки.Добавить("СтатьяЗатратВзносы", Новый ОписаниеТипов("СправочникСсылка.СтатьиЗатрат"));
	Таблица.Колонки.Добавить("СчетКтВзносы", Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	
	Возврат Таблица;
	
КонецФункции

Функция РасчетРезерваОтпусков(Организация, ПериодРегистрации, ТаблицаНачисленнаяЗарплатаИВзносы)
	
	Если НЕ УчетЗарплаты.ИспользованиеРезерваОтпусков(Организация) Тогда
		//Учет резерва отпусков не ведется
		Возврат ТаблицаНачисленнаяЗарплатаИВзносы;
	КонецЕсли;	
	
	Срез = РегистрыСведений.КоэффициентРезерваОтпусков.СрезПоследних(ПериодРегистрации,Новый Структура ("Организация", Организация));
	Если Срез.Количество() = 0 Тогда
		//коэффициент не задан, по умолчанию 1
		КоэффициентРезерваОтпусков = 1;
	Иначе
		КоэффициентРезерваОтпусков = Мин(Срез[0].Коэффициент,1);
	Конецесли;
	
	Если КоэффициентРезерваОтпусков = 0 Тогда
		//Распределять не требуется
		Возврат ТаблицаНачисленнаяЗарплатаИВзносы;
	КонецЕсли;	
	
	Для Каждого СтрокаТаблицы из ТаблицаНачисленнаяЗарплатаИВзносы Цикл
		Если СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.НачисленоОтпускныеДоход Тогда
			Сумма = СтрокаТаблицы.Сумма;
			СуммаВзносы = СтрокаТаблицы.СуммаВзносы;
			Резерв = Окр(Сумма*КоэффициентРезерваОтпусков,2);
			РезервВзносы = Окр(СуммаВзносы*КоэффициентРезерваОтпусков,2);
			
			//Оставляем сумму за вычетом резерва
			СтрокаТаблицы.Сумма = Сумма - Резерв;
			СтрокаТаблицы.СуммаВзносы = СуммаВзносы - РезервВзносы;
			
			//Добавляем строки за счет резерва
			СтрокаРезерв = ТаблицаНачисленнаяЗарплатаИВзносы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаРезерв, СтрокаТаблицы);
			СтрокаРезерв.Сумма = Резерв;
			СтрокаРезерв.СуммаВзносы = РезервВзносы;
			СтрокаРезерв.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.НачисленоОтпускныеРезерв;
		КонецЕсли;
		
	КонецЦикла;	
	
	Возврат ТаблицаНачисленнаяЗарплатаИВзносы;
	
КонецФункции	


////////////////////////////////////////////////////////////////////////////////
// Блок функций первоначального заполнения и обновления ИБ
//

// Добавляет в список Обработчики процедуры-обработчики обновления,
// необходимые данной подсистеме.
//
// Параметры:
//   Обработчики - ТаблицаЗначений - см. описание функции НоваяТаблицаОбработчиковОбновления
//                                   общего модуля ОбновлениеИнформационнойБазы.
// 
Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт
	
	
КонецПроцедуры
